# Користувач повинен ввести число більше або дорівнює 0 і менше ніж 8640000.
# Число, яке є кількістю секунд, необхідно перевести в дні, години, хвилини та секунди.
# Ну і додатковим завданням є турбота про виведення.
# Слово "день" підбирається на основі кількості днів, а години, хвилини і секунди повинні заповнюватися нулями при одноцифрових значеннях.
# Підказка: одна хвилина - 60 сек. , В одній годині 60 * 60 сек, в одній добі 24 * 60 * 60 сек.
# Тобто використовуючи функцію divmod або методи поділу // і % вам необхідно знайти відповідну кількість днів,
# годин, хвилин, а те що залишиться - це секунди, які менше 60 ;)
# 0 -> 0 днів, 00:00:00
# 224930 -> 2 дні, 14:28:50
# 466289 -> 5 днів, 09:31:29
# 950400 -> 11 днів, 00:00:00
# 1209600 -> 14 днів, 00:00:00
# 1900800 - > 22 дні, 00:00:00
# 8639999 -> 99 днів, 23:59:59
# 22493 -> 0 днів, 06:14:53
# 7948799 -> 91 день, 23:59:59

user_input = input("число від 0 до 8640000: ")
user_input_string = int(user_input)
days, hours_in = divmod(user_input_string, 24*60*60)
hours, minutes_in = divmod(hours_in, 60*60)
minutes, seconds_in = divmod(minutes_in, 60)

n = days # кількість днів -
if 11 <= n % 100 <= 20:
    word = "днів"
else:
    last_digit = n % 10
    if last_digit == 1:
        word = "день"
    elif 2 <= last_digit <= 4:
        word = "дні"
    else:
        word = "днів"
print(f"{days} {word}, {hours:02}:{minutes:02}:{seconds_in:02}")
